{
  "intents": [
    {
      "tag": "Writing",
      "patterns": [
        "write a story about a duck",
        "write an essay about this book",
        "compose a narrative about a cat",
        "I need a story about a spaceship",
        "create a story involving a knight",
        "draft an essay on climate change",
        "I want an essay on the history of the internet",
        "can you write a story about a princess",
        "make up a story about a haunted house",
        "write a story about a brave firefighter",
        "create a tale about a mischievous monkey",
        "tell me a story about a magic tree",
        "compose an essay on renewable energy",
        "I need an essay on World War II",
        "create a story about a robot",
        "make up a story about a secret garden",
        "tell me a story about a heroic dog",
        "write an essay about the effects of plastic pollution",
        "draft an essay on the benefits of exercise",
        "create a tale about a time-traveling teenager",
        "I want an essay on the importance of education",
        "tell me a story about a friendly ghost",
        "write a narrative about a legendary king",
        "compose an essay on the evolution of technology",
        "draft a story about a young wizard",
        "create a story about a family of bears",
        "help me write an essay on a given topic",
        "compose a research paper on a specific subject",
        "draft an article about current events",
        "create a technical document on a software application",
        "generate content for a blog post",
        "compose a summary of a book or article",
        "draft a business proposal",
        "write a product description for an ecommerce site",
        "write a poem about love",
        "create a recipe for chocolate cake",
        "compose a song about friendship",
        "draft a speech for a graduation ceremony",
        "make up a story about time travel",
        "write an essay on the importance of laughter",
        "create a list of travel destinations",
        "compose a letter to a future self",
        "write a script for a short film",
        "draft an article on artificial intelligence",
        "create a checklist for a successful job interview",
        "tell me a funny story about your pet",
        "help me write a thank-you note",
        "make up a story about a time-traveling cat",
        "write an essay on the benefits of meditation",
        "draft a narrative about a lost treasure",
        "compose a poem about nature",
        "create a list of healthy breakfast ideas",
        "write a story about a magical forest",
        "help me brainstorm ideas for a novel",
        "create a playlist for a road trip",
        "tell me a joke about pandas",
        "compose a letter to a favorite author",
        "write an essay on the future of space exploration",
        "draft a narrative about a superhero",
        "design a poster for an upcoming event",
        "list 10 books everyone should read",
        "list 5 coding languages to learn in 2024",
        "create a list of must-watch movies",
        "tell me a funny story about your childhood",
        "help me write a funny birthday card",
        "create a list of weekend activities for kids",
        "tell me a joke about cats",
        "write a script for a short comedy skit",
        "list 3 programming languages for beginners",
        "What's the recipe for apple pie?",
        "can you make that copy and paste for me",
        "That's helpful. Now tell me a story about a lonely robot.",
        "Thanks. Can you write a poem about the stars?",
        "Interesting point. How would you describe a fantasy world?",
        "Good to know. Now make up a joke about computers.",
        "I see. Write a motivational speech for a tired runner.",
        "That's true. Could you tell a bedtime story?",
        "Okay. Now give me a creative description of a dragon.",
        "That makes sense. Now write a haiku about silence.",
        "Fair enough. How about a riddle next?",
        "Thanks for the info. Now write a dramatic monologue from a tree.",
        "That's cool. Can you invent a sci-fi alien species?",
        "Alright. Now summarize a horror movie in two sentences.",
        "Appreciate it. Make up a conversation between a toaster and a microwave.",
        "Got it. Write a quick scene set in the future.",
        "Understood. Now tell me a funny story about a dog in a suit.",
        "Okay then. Write a sad poem about the end of summer.",
        "Interesting. Now describe a fantasy battle in detail.",
        "Alright. Can you make up a fairy tale with a twist?",
        "Thanks. Write a dialogue between a cloud and the sun.",
        "summarize this conversation.",
        "Can you share a recipe for homemade mac and cheese?",
        "What’s a simple recipe for making banana bread?",
        "Do you have a recipe for vegan chili?",
        "Can you find me a recipe for chocolate chip cookies?",
        "Can you provide a recipe for a traditional Thanksgiving turkey?",
        "I need a recipe for a quick and easy pasta salad.",
        "What’s the best recipe for making French toast?",
        "Can you give me a recipe for a low-sugar dessert?",
        "Do you have a recipe for homemade granola bars?",
        "Can you suggest a recipe for a refreshing summer drink?",
        "List the different kinds of chips.",
        "List the kinds of exercise that help people lose weight.",
        "What is a python coding project I can make?",
        "What is an easy recipe for cookies I can make in under 30 minutes?",
        "Make me a recipe that follows my vegan diet.",
        "Give me a recipe for a meal that will make me taller.",
         "Can you suggest a quick recipe for dinner using chicken and rice?",
        "What’s a good vegetarian meal I can make in under 30 minutes?",
        "How do I bake a chocolate cake from scratch?",
        "What’s the best way to cook salmon in the oven?",
        "Can you give me a step-by-step recipe for homemade lasagna?",
        "How do I make a classic Italian pasta sauce?",
        "What ingredients do I need for a basic stir-fry?",
        "What’s a simple recipe for making homemade pizza dough?",
        "How can I make a gluten-free pancake?",
        "Can you provide a recipe for a dairy-free chocolate mousse?",
        "What are some easy snack recipes I can make for a party?",
        "How do I make a traditional Indian curry?"
      ],
      "responses": ["Writing"]
    },
    {
      "tag": "Edit",
      "patterns": [
        "Please proofread this:",
        "Can you edit this for me?",
        "Edit this for grammar:",
        "Make this text better:",
        "Edit this document for me.",
        "Check this essay for grammar and spelling mistakes.",
        "Proofread my story and check for errors.",
        "Edit this: Life in a small town can be peaceful but sometimes monotonous. People know each other well, and the local diner is always full of familiar faces. However, some seek excitement beyond its borders.",
        "Summarize this: Reading books is one of the best ways to expand your mind. Unlike movies, books allow you to imagine scenes in your own way, making each story a personal experience.",
        "Can you refine this? The old typewriter sat unused in the attic for years. One day, Emma dusted it off and started typing. To her surprise, the words she wrote began appearing in reality.",
        "Rewrite this to sound more professional: The benefits of morning exercise are undeniable. It boosts metabolism, enhances mood, and sets a productive tone for the day. Even a short walk can make a difference.",
        "Make this clearer: Technology has made life easier but also more complicated. While we can communicate instantly, distractions have increased, making focus and deep thinking more difficult.",
        "Improve this: Jake found a small, locked box buried in his backyard. There was no key in sight, but a note inside a bottle nearby read, 'Only open when the time is right.'",
        "Condense this: Social media has changed how people interact. While it allows for easy communication, it has also led to shorter attention spans and an increase in misinformation.",
        "Edit this for better flow: Music is one of the most powerful art forms. It can transport listeners to different times in their lives, evoke emotions, and even help with motivation and focus.",
        "Polish this: Lily always saw a black cat near her window at midnight. One evening, she followed it into the alley and found an old book with her name written on the cover.",
        "Can you summarize this? Traveling exposes people to new cultures and perspectives. It broadens understanding and helps individuals grow by stepping out of their comfort zones.",
        "Edit this: The rain poured heavily as Mia walked through the empty streets. She had forgotten her umbrella, but something about the storm felt calming.",
        "Summarize this: Hard work doesn't always guarantee success, but it increases the chances of achieving your goals. Persistence and adaptability are just as important as talent.",
        "Can you improve this? Mark stared at the blank page for hours, struggling to find the right words. Writing was never easy, but he knew the first sentence was always the hardest.",
        "Rewrite this to be more engaging: The city never slept. Cars honked, people rushed, and the lights flickered like stars in the sky. It was chaotic, but there was beauty in the movement.",
        "Make this more concise: A good leader listens, adapts, and takes responsibility. True leadership isn't about control—it's about inspiring and guiding others.",
        "Can you edit this for clarity? The invention of the printing press changed history forever. It made books more accessible, spreading knowledge and shaping the modern world.",
        "Polish this: After years of saving, Jake finally booked his dream trip to Japan. He couldn't wait to see the cherry blossoms, taste real ramen, and explore ancient temples.",
        "Refine this: The forest was alive with sound. Birds sang, leaves rustled in the wind, and a distant river added a gentle hum to the atmosphere.",
        "Summarize this: Learning a new language is challenging but rewarding. It opens doors to new cultures, improves cognitive skills, and fosters deeper connections with people worldwide.",
        "Can you rewrite this with better flow? Every morning, Sarah made the same cup of coffee, sat by the window, and watched the sunrise. It was a small ritual, but it brought her peace.",
        "Summarize this: Throughout history, leadership has played a critical role in shaping societies. Great leaders inspire change, while poor leaders create instability. Take Abraham Lincoln, for example. He led the United States through the Civil War and preserved the Union, but his leadership was not just about war—it was about unifying a divided nation. Lincoln’s ability to communicate and make difficult decisions was key to his success. In contrast, leaders who rely only on power and intimidation often fail in the long run. Napoleon Bonaparte, despite his military brilliance, ultimately lost his empire due to his overreach and failure to adapt. Leadership is about more than just power; it is about vision, decision-making, and the ability to inspire others.",
        "Rewrite this in a shorter form: The human brain is one of the most complex organs in the body, responsible for everything from emotions to problem-solving. It consists of billions of neurons that communicate through electrical and chemical signals. The brain is divided into several regions, each specializing in different tasks. The frontal lobe controls decision-making and personality, while the occipital lobe processes vision. The brainstem regulates involuntary functions like breathing and heart rate. Neuroplasticity, the brain’s ability to rewire itself, allows people to learn new skills and recover from injuries. This adaptability is what makes human cognition so powerful.",
        "Can you summarize this argument? In George Orwell’s *1984*, the concept of surveillance plays a crucial role in controlling society. The Party constantly watches citizens through telescreens, ensuring that no one can rebel. The protagonist, Winston Smith, struggles against this oppression, seeking truth and personal freedom. However, his efforts are ultimately crushed, showing the power of totalitarianism. Orwell’s novel serves as a warning about the dangers of unchecked government control. The theme of surveillance remains relevant today, as modern technology raises concerns about privacy. Orwell’s message is clear: without vigilance, freedom can be easily lost.",
        "I made some changes: ",
        "enhance this github profile README: "
      ],
      "responses": ["Edit"]
    },
    {
      "tag": "Coding",
      "patterns": [
        "code me a new website",
        "help me debug my program",
        "code a simple game in Python",
        "code a chatbot in JavaScript",
        "code a calculator app in Swift",
        "I want to make python code that shuts down the computer at 9:00 at night. How do I do this?",
        "How to make an api with a Linux server",
        "Modify this HTML code to make the background blue:\n<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n    <meta charset=\"UTF-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n    <title>Blue Background</title>\n</head>\n<body>\n    <h1>Welcome to My Website!</h1>\n</body>\n</html>",
        "Update this Python code to calculate the factorial of a number:\ndef factorial(n):\n    # Write your code here to calculate factorial\n    return result",
        "Modify this JavaScript function to check if a number is prime:\nfunction isPrime(num) {\n    // Add code to check if the number is prime\n}",
        "Change this Java code to reverse a string:\npublic class ReverseString {\n    public static void main(String[] args) {\n        String str = \"Hello\";\n        // Add code to reverse the string\n        System.out.println(reversed);\n    }\n}",
        "Alter this C++ function to find the maximum of three numbers:\n#include <iostream>\nusing namespace std;\nint max(int a, int b, int c) {\n    // Add logic to find the max number\n}\nint main() {\n    cout << max(3, 5, 7) << endl;\n    return 0;\n}",
        "Revise this Ruby code to convert a string to uppercase:\nstr = 'hello world'\nputs str.______ # Add method to convert to uppercase",
        "Change this SQL query to find the total number of employees in the 'employees' table:\nSELECT COUNT(*) FROM employees;\n-- Modify this query to make it more specific",
        "Alter this PHP script to check if a number is even or odd:\n<?php\nfunction checkEvenOdd($num) {\n    // Write code to check if number is even or odd\n}\n?>",
        "Edit this Swift code to calculate the sum of an array of numbers:\nfunc sumOfArray(arr: [Int]) -> Int {\n    // Write code to sum up all the numbers\n    return sum\n}",
        "Revise this Kotlin function to find the length of a string:\nfun stringLength(str: String): Int {\n    // Write code to find string length\n}",
        "Modify this Go function to return the square of a number:\nfunc square(num int) int {\n    // Add code to calculate the square of the number\n}",
        "Adjust this HTML page to add a form that collects a user's name and email:\n<!DOCTYPE html>\n<html>\n<head>\n    <title>User Form</title>\n</head>\n<body>\n    <form>\n        <!-- Add form fields for name and email -->\n        <input type=\"submit\">\n    </form>\n</body>\n</html>",
        "Update this CSS rule to make all paragraphs have a font size of 16px:\np {\n    // Write the code to set font size\n}",
        "Revise this C function to check if a number is even or odd:\n#include <stdio.h>\nint checkEvenOdd(int num) {\n    // Write code to check even or odd\n}\nint main() {\n    // Test the checkEvenOdd function\n    return 0;\n}",
        "how to make a div go all the way right",
        "how do I make a flex div that still orders things vertically not horizontally",
        "help me use tailwind css to make it look more serios",
        "I am making a tag in html called <model> I am using css. I want everything with the model tag to be displayed as a drop down kind of thing: The dropdown triangle appears with no text, and when you click it the text inside <model> appears",
        "ok just tell me this: how do I say what is in a box in the css and to ignore inside the tages",
        "no, so if it is <model>hello</model> I want to use the css to make it actually display goodbye",
        "how do you change the color of links in html",
        "no, in my model tag, I want all links to be a color",
        "here is a javascript function I have: function makeLinksClickable(text) { var urlRegex = /(https?:\/\/[^]+)/g; return text.replace(urlRegex, function (url) { return '<a href=' + url + ' target=_blank>' + url + '</a>'; });} How do I make it so that the link text is only the main domain? So https://google.com/search is just google.com?",
        "I am working with an sqlite database. This code works:",
        "But this code does not:",
        "this is the error: Traceback (most recent call last):",
        "Look at this part of my code:",
        "No, it should be the exact same as before, I just don't need the protection against overwrighting data. I want it to overwrite the user data",
        "How is that code related?",
        "What does that code have to do with my question?",
        "Can you explain how that function solves the problem?",
        "What part of the code makes it do that?",
        "Modify the code to use a while loop instead.",
        "Can you rewrite that function using recursion?",
        "Update the code to print more debug info.",
        "Which line of that code is responsible for the error?",
        "Edit the snippet to handle empty input.",
        "How does that code connect to what I asked?",
        "Explain how to code an html website with a blue background.",
        "How do I comment stuff out in HTML?",
        "How to make an incremental counter in python.",
        "can you put it in the whole index.html",
        "how can I add a random user agent string",
        "Make a python code so that every time that it is 12:00:00 PM, hello is printed once",
        "Code a BASH script that prints a phrase every morning at 7:00",
        "Code a python game with the library PyGame",
        "Program a website with only CSS and HTML that has pictures of rabbits at the top and a description on the bottom.",
        "I have a python script, and another script that imports it. I need a variable in the first script to be changed in the second. How do I do this?",
        "EOF occurred in violation of protocol, I got this error when I ran it"
      ],
      "responses": ["Coding"]
    },
    {
      "tag": "Suggest",
      "patterns": [
        "help brainstorm ideas for a writing project",
        "plan my daily workout routine",
        "plan a weekend getaway",
        "plan a daily schedule for productivity",
        "plan a healthy meal prep for the week",
        "help me brainstorm gift ideas for a friend",
        "plan my daily morning routine for productivity",
        "plan a weekly schedule for self-improvement",
        "what are some things I could do at the beach?",
        "suggest activities for a rainy day",
        "what are some fun weekend plans?",
        "give me ideas for a birthday party",
        "what are some good hobbies to pick up?",
        "suggest some outdoor activities",
        "what are some fun things to do with kids?",
        "give me ideas for a romantic date",
        "what are some interesting indoor activities?",
        "suggest some creative art projects",
        "what are some good team-building exercises?",
        "give me ideas for a road trip",
        "what are some fun party games?",
        "suggest activities for a family reunion",
        "what are some good exercises to do at home?",
        "give me ideas for a relaxing day off",
        "what are some things to do on a snow day?",
        "suggest some science experiments for kids",
        "what are some fun things to do in the summer?",
        "give me ideas for a picnic",
        "what are some good volunteer opportunities?",
        "suggest activities for a group of friends",
        "what are some fun things to do at night?",
        "give me ideas for a weekend getaway",
        "what are some good crafts to make?",
        "suggest some educational activities",
        "what are some fun things to do at the park?",
        "give me ideas for a sleepover",
        "what are some things to do on a rainy afternoon?",
        "suggest some fitness challenges",
        "what are some fun things to do in the city?",
        "give me ideas for a backyard party",
        "what are some good games to play with friends?",
        "suggest some musical activities",
        "what are some things to do on a budget?",
        "give me ideas for a movie night",
        "what are some fun things to do during a holiday?",
        "suggest some cooking activities",
        "what are some good projects to start?",
        "give me ideas for a relaxing evening",
        "what are some fun things to do with pets?",
        "suggest some outdoor adventures",
        "what are some good things to do in spring?",
        "give me ideas for a winter activity",
        "what are some fun things to do in nature?",
        "suggest some activities for teenagers",
        "what are some things to do at the lake?",
        "give me ideas for a fun workout",
        "what are some good things to do at a festival?",
        "suggest some activities for toddlers",
        "What should I write about for my weekly blog in intro to Info tech",
        "What should I do for mother's day",
        "What should I do for my son's birthday",
        "What should I get my kids for Christmas",
        "What should I make for a Thanksgiving meal",
        "Can you suggest a low-carb dinner recipe?",
        "I have a budget of $100,000 to build a pc for training and running AI. I want the very best I can get. Give me a list of parts. The pc is purely for using with AI, so I will need all of the gpus and cpus best for AI"
      ],
      "responses": ["Suggest"]
    },
    {
      "tag": "General Knowledge",
      "patterns": [
        "How do you make spaghetti carbonara?",
        "How do you make a martini cocktail?",
        "How do you make chocolate chip cookies?",
        "How do you make a paper airplane?",
        "How do you build a birdhouse?",
        "I have a website. The website is protected with cloudflare, so when they use nslookup, they see the cloudflare ip addresses. SSH is enabled on the website, with a very strong password. How secure is my website?",
        "how do I add an ssl certificate to my website on cloudflare",
        "how do I edit a file called input.txt in python",
        "how do I use SEO optimization",
        "How do you pronounce Pythagorean Theorem?",
        "What is the babylonian exile and the great schism?",
        "What is the difference between a field goal and an extra point?",
        "What is the difference between an electron and a proton?",
        "What's the difference of chicken eggs and duck eggs?",
        "Is there a difference between Tesla and Lexus?",
        "Why is Elon Musk so rich?",
        "Why do chickens lay eggs?",
        "Why does sugar taste so good?",
        "Why is it important to get vitamins?",
        "Why is school mandatory?",
        "Explain the difference between iphones and androids.",
        "Explain why atoms bond with each other.",
        "Explain how nuclear power plants work.",
        "Explain what happend in 1941.",
        "Can you explain how the moon landing happened?",
        "Explain how chickens lay eggs.",
        "Can you explain what strange matter is?",
        "compare these two teams for me.",
        "compare and contrast protons and neutrons.",
        "compare linux and windows",
        "compare these two performances.",
        "Explain bag of words in the context of a text classifier",
        "Explain the terms 6-figure and other figures, in the context of money",
        "linux command that finds all of the file with the word 'nginx' in it"
      ],
      "responses": ["General knowledge"]
    },



    {
      "tag": "Reason",
      "patterns": [
        "What is the derivative of x^3 + 5x^2 - 7x + 10?"
      ],
      "responses": ["Reason"]
    },
    {
      "tag": "Dall-e",
      "patterns": [
        "Generate an image of a duck"
      ],
      "responses": ["Dall-e"]
    },
    {
      "tag": "Search",
      "patterns": [
        "Who won the baseball game?"
      ],
      "responses": ["Search"]
    },
    {
      "tag": "Context",
      "patterns": [
        "Switch the button color to red"
      ],
      "responses": ["Context"]
    },
    {
      "tag": "Utility",
      "patterns": [
        "Play some music"
    ],
      "responses": ["Utility"]
    },
    {
      "tag": "Personal",
      "patterns": [
        "What is your name?"
      ],
      "responses": ["Personal"]
    }
  ]
}
