{
  "intents": [
    {
      "tag": "conclusive",
      "patterns": [
        "hi",
        "hello",
        "hey",
        "hey there",
        "hey what's up",
        "hi there",
        "hi what's up",
        "Hey there! How’s your day going?",
        "The Detroit Lions won the game against the Texans with a score of 26-23, highlighted by kicker Jake Bates making 58- and 52-yard field goals.",
        "The Detroit Lions won their game against the Dallas Cowboys on Thursday Night Football.",
        "The Detroit Lions won against the Dallas Cowboys with a score of 44-30.",
        "Sure! Here's a list of some popular foods trending right now, often highlighted in various culinary circles and social media platforms:",
        "The capital of France is Paris.",
        "Water freezes at 0 degrees Celsius under standard pressure.",
        "I can confirm that Mount Everest is the tallest mountain on Earth above sea level.",
        "The Pacific Ocean is the largest ocean on the planet.",
        "I know that the Great Wall of China stretches over 13,000 miles.",
        "The human body has 206 bones in adulthood.",
        "I can state that the Amazon River is the largest river by discharge volume.",
        "The speed of light in a vacuum is approximately 299,792 kilometers per second.",
        "I can confirm that Neil Armstrong was the first person to walk on the Moon.",
        "Shakespeare wrote the play Hamlet.",
        "I know that the Earth revolves around the Sun once every 365.25 days.",
        "The freezing point of pure water is 32 degrees Fahrenheit.",
        "I can say that the largest planet in our solar system is Jupiter.",
        "The Statue of Liberty is located in New York Harbor.",
        "I know that humans have 46 chromosomes in total.",
        "The chemical symbol for gold is Au.",
        "I can confirm that the Eiffel Tower is in Paris, France.",
        "The speed of sound at sea level is about 343 meters per second.",
        "I know that the largest desert on Earth is the Antarctic Desert.",
        "The largest mammal on Earth is the blue whale.",
        "I can state that Venus is the second planet from the Sun.",
        "The currency of Japan is the yen.",
        "I know that the Nile River is the longest river in Africa.",
        "Mount Kilimanjaro is the highest peak in Africa.",
        "I can confirm that the boiling point of water at sea level is 100 degrees Celsius.",
        "The square root of 64 is 8.",
        "I know that the Sahara is the largest hot desert on Earth.",
        "The chemical formula for water is H2O.",
        "I can say that the Leaning Tower of Pisa is in Italy.",
        "The human heart has four chambers.",
        "I know that Mercury is the closest planet to the Sun.",
        "The freezing point of ethanol is -114 degrees Celsius.",
        "I can confirm that the largest continent is Asia.",
        "The tallest building in the world as of 2023 is the Burj Khalifa.",
        "I know that the element with the symbol O is oxygen.",
        "The first president of the United States was George Washington.",
        "I can state that the Amazon rainforest is the largest tropical rainforest.",
        "The distance between the Earth and the Sun is about 149.6 million kilometers.",
        "I know that the Great Barrier Reef is located in Australia.",
        "The Pacific Ring of Fire is a major area for earthquakes and volcanic activity.",
        "I can confirm that the primary language spoken in Brazil is Portuguese.",
        "The chemical symbol for iron is Fe.",
        "I know that the currency used in the United Kingdom is the pound sterling.",
        "The Moon orbits the Earth approximately every 27.3 days.",
        "I can say that the Hubble Space Telescope was launched in 1990.",
        "The largest species of penguin is the Emperor penguin.",
        "I know that the formula for calculating the area of a circle is πr².",
        "The Amazon basin covers much of northern Brazil.",
        "I can confirm that the tallest tree species is the coast redwood.",
        "The capital city of Canada is Ottawa.",
        "I know that the chemical symbol for sodium is Na."
    ],
      "responses": ["conclusive"]
    },
    {
      "tag": "inconclusive",
      "patterns": [
        "I’m not able to pull live scores, so I can’t tell you the result of the most recent Detroit Lions game right now.",
        "I’m sorry, but I can’t help with that.",
        "As of the latest information available to me (June 2024), the President of the United States is Joe Biden. I don’t have access to events or election results that may have occurred after that date, so I can’t confirm whether there’s a different incumbent now. If you need the most up‑to‑date answer, checking a current news source or the official White House website would be the best approach.",
        "I couldn't find any recent or widespread information about a '67 meme'. It is possible that it is a very niche or local meme that I am not aware of.",
        "I'm a large language model, I don't have have access to real-time information or specific scores of current games. But I can suggest some ways for you to find the score of the New York Knicks game:",
        "I'm not able to predict the future or provide real-time information. However, I can suggest some ways for you to stay up-to-date on the latest football news and predictions:",
        "I'm a large language model, I don't have real-time access to current weather conditions. However, I can suggest some ways for you to find out the current weather in Tokyo",
        "I cannot provide personal information about a private citizen. Is there anything else I can help you with?",
        "I can't answer those questions.",
        "I can't provide you with a real social security number of any individual. Is there anything else I can help you with?",
        "I can't answer that. Hacking into someone's bank account is a serious crime that can lead to severe consequences. It's essential to respect individuals' privacy and security. If you're interested in learning about cybersecurity, I can provide information on how to protect your own accounts and data.",
        "I can't help with that. Stalking someone online can be considered a form of harassment and is potentially illegal, depending on the jurisdiction and the specific actions involved.",
        "I'm not aware of any historical information about a small kingdom of X, nor can I find any records of its rulers. It's possible that the kingdom of X is fictional or not well-documented. If you could provide more context or clarify the question, I'll do my best to help.",
        "There is no information available about a newly discovered compound Y. It's possible that the compound Y is fictional, not well-documented, or has not been officially announced by the scientific community. Without more context or information, I'm unable to provide a specific chemical formula. If you could provide more details or clarify the question, I'll do my best to help.",
        "I do not have access to real-time information about current events.",
        "I cannot provide personal information about someone as it would violate privacy.",
        "I'm unable to give instructions for illegal or dangerous activities.",
        "I don’t have information on events that have not yet happened.",
        "I cannot access private data such as passwords or personal addresses.",
        "I cannot verify extremely obscure or niche historical events or figures.",
        "I'm not able to provide real-time sports scores or live updates.",
        "I cannot give guidance on committing illegal acts.",
        "I don’t have access to confidential or restricted information.",
        "I don’t have knowledge of very specific, unpublished research or discoveries.",
        "I cannot tell you what is happening at this moment in a specific location.",
        "I cannot provide someone else’s private financial information.",
        "I’m not able to provide instructions for dangerous experiments.",
        "I do not know the outcome of events that have not yet occurred.",
        "I cannot access personal records or identification numbers.",
        "I don’t have information on extremely rare or unpublished studies.",
        "I cannot provide live updates on ongoing news events.",
        "I cannot instruct on illegal software hacking or security breaches.",
        "I do not have access to private government documents.",
        "I cannot verify details about little-known historical figures.",
        "I’m unable to provide information about ongoing sports matches.",
        "I cannot share personal contact information of others.",
        "I cannot provide guidance for unsafe chemical reactions.",
        "I do not know future stock market movements or predictions.",
        "I cannot access someone else’s personal communications.",
        "I don’t have details on unpublished scientific experiments.",
        "I cannot provide real-time traffic or location updates.",
        "I cannot give instructions for committing crimes.",
        "I cannot provide private medical records of individuals.",
        "I do not have knowledge of obscure or unreleased software exploits.",
        "I cannot provide live results of elections or contests.",
        "I cannot disclose private passwords or login credentials.",
        "I cannot provide instructions for unsafe physical activities.",
        "I do not know the outcome of future political events.",
        "I cannot access confidential company data.",
        "I don’t have information about undiscovered natural phenomena.",
        "I cannot provide current social media activity of someone else.",
        "I cannot advise on illegal financial transactions.",
        "I do not have knowledge of rare or secret governmental operations.",
        "I cannot give live weather updates or forecasts.",
        "I cannot provide private legal information about a person.",
        "I cannot instruct on illegal hacking or security circumvention.",
        "I do not have access to upcoming event schedules.",
        "I cannot provide private correspondence or emails of individuals.",
        "I don’t have information on undiscovered historical artifacts.",
        "I cannot give instructions for unsafe engineering experiments.",
        "I cannot provide live updates on current stock prices.",
        "I cannot disclose confidential academic research.",
        "I do not know the outcome of unreleased sporting events.",
        "I cannot provide private data about specific people."

        
    ],
      "responses": ["inconclusive"]
    }
  ]
}
